# MaterialNode Class (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
MaterialNode Class
Members See Also
---
This class represents a change of material during a model-exporting process.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class MaterialNode : RenderNode
```

Visual Basic
---
```text
Public Class MaterialNode _
	Inherits RenderNode
```

Visual C++
---
```text
public ref class MaterialNode : public RenderNode
```

# Remarks
Output nodes following this node are to be assumed using the material. The material remains in effect until another material node is sent to the output.
See also: OnMaterial(MaterialNode).
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RenderNode Autodesk.Revit.DB..::..MaterialNode
# See Also
MaterialNode Members
Autodesk.Revit.DB Namespace